cfdSimulation/NASAsc2-0410_rhoPimpleFoam/0/yPlus
/*
--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    domainWalls
    {
        type            calculated;
        value           uniform 0;
    }
    fixedWall
    {
        type            symmetry;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    NASAsc2-0410
    {
        type            calculated;
        value           nonuniform List<scalar> 
53952
(
195.73812
19.425465
19.50182
19.339784
19.409126
19.328293
19.434343
209.92783
...
)
;
    }
}


// ************************************************************************* //
